Revit 2027 API
BuiltInFailures.StructuralSectionsFailures.StructuralSectionCannotBeDetermined Property
 The section cannot be determined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralSectionCannotBeDetermined { get; }
Public Shared ReadOnly Property StructuralSectionCannotBeDetermined As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralSectionCannotBeDetermined {
	FailureDefinitionId^ get ();
}
static member StructuralSectionCannotBeDetermined : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralSectionsFailures Class
Autodesk.Revit.DB Namespace